In [2]:
!pip install pandasql

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
Requirement already satisfied: numpy in /home/vkkr125/anaconda3/lib/python3.8/site-packages (from pandasql) (1.19.2)
Requirement already satisfied: pandas in /home/vkkr125/anaconda3/lib/python3.8/site-packages (from pandasql) (1.1.3)
Requirement already satisfied: sqlalchemy in /home/vkkr125/anaconda3/lib/python3.8/site-packages (from pandasql) (1.3.20)
Requirement already satisfied: pytz>=2017.2 in /home/vkkr125/anaconda3/lib/python3.8/site-packages (from pandas->pandasql) (2020.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /home/vkkr125/anaconda3/lib/python3.8/site-packages (from pandas->pandasql) (2.8.1)
Requirement already satisfied: six>=1.5 in /home/vkkr125/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas->pandasql) (1.15.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26818 sha256=f29196052152a41d570091eb5219de0dfbf4d21180bcc5cc0c0c4506e77601b3
  Stored in directory: /home/vkkr125/.cache/pip/wheels/ed/8f/46/a383923333728744f01ba24adbd8e364f2cb9470a8b8e5b9ff
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [5]:
from pandasql import sqldf
import pandas as pd
pysqldf = lambda q: sqldf(q, globals())

In [7]:
data1 = pd.read_csv('/home/vkkr125/Downloads/data1.csv')
data1

            Order ID       Product ID  Qty
0     CA-2014-100006  TEC-PH-10002075    3
1     CA-2014-100090  FUR-TA-10003715    3
2     CA-2014-100090  OFF-BI-10001597    6
3     CA-2014-100293  OFF-PA-10000176    6
4     CA-2014-100328  OFF-BI-10000343    1
...              ...              ...  ...
9473  US-2017-169551  OFF-PA-10004100    3
9474  US-2017-169551  OFF-ST-10004835    3
9475  US-2017-169551  TEC-AC-10002018    3
9476  US-2017-169551  TEC-AC-10003033    2
9477  US-2017-169551  TEC-PH-10001363    2

[9478 rows x 3 columns]

In [9]:
data2 = pd.read_csv('/home/vkkr125/Downloads/data2.csv')
data2

            Order ID       Product ID  Qty
0     CA-2014-100090  FUR-TA-10003715    3
1     CA-2014-100090  OFF-BI-10001597    6
2     CA-2014-100293  OFF-PA-10000176    6
3     CA-2014-100328  OFF-BI-10000343    1
4     CA-2014-100363  OFF-FA-10000611    2
...              ...              ...  ...
9474  US-2017-169551  OFF-PA-10004100    3
9475  US-2017-169551  OFF-ST-10004835    3
9476  US-2017-169551  TEC-AC-10002018    3
9477  US-2017-169551  TEC-AC-10003033    2
9478  US-2017-169551  TEC-PH-10001363    2

[9479 rows x 3 columns]

In [12]:
# test sql 
df_sql = pysqldf('select * from data1')
df_sql.head()

         Order ID       Product ID  Qty
0  CA-2014-100006  TEC-PH-10002075    3
1  CA-2014-100090  FUR-TA-10003715    3
2  CA-2014-100090  OFF-BI-10001597    6
3  CA-2014-100293  OFF-PA-10000176    6
4  CA-2014-100328  OFF-BI-10000343    1

# Task1

In [ ]:
# 1. How to identify the Records (Order ID + Product ID combination) present in data1 but
# missing in data2 (Specify the number of records missing in your answer)
# 2. How to identify the Records (Order ID + Product ID combination) missing in data1 but
# present in data2 (Specify the number of records missing in your answer)
# 3. Find the Sum of the total Qty of Records missing in data1 but present in data2
# 4. Find the total number of unique records (Order ID + Product ID combination) present in
# the combined dataset of data1 and data2

##### 1) How to identify the Records (Order ID + Product ID combination) present in data1 but missing in data2 (Specify the number of records missing in your answer)

In [32]:
query_result1 = pysqldf('select data1.`Order ID`,data1.`Product ID` from data1 left join data2 on\
    data1.`Order ID` = data2.`Order ID` and data1.`Product ID` = data2.`Product ID` where data2.`Order ID` is null \
    and data2.`Product ID` is null')

print(query_result1) # data frame of all the rows of first query 

print('\n\ncount of all the rows(Order ID + Product ID) that are present in data1 but not present in data2')
print(query_result1.count())

           Order ID       Product ID
0    CA-2014-100006  TEC-PH-10002075
1    CA-2014-100678  OFF-EN-10000056
2    CA-2014-100895  OFF-AR-10004511
3    CA-2014-101560  OFF-BI-10000309
4    CA-2014-102673  OFF-LA-10001771
..              ...              ...
502  US-2017-160836  OFF-AP-10001626
503  US-2017-162558  FUR-FU-10002364
504  US-2017-163657  OFF-BI-10000138
505  US-2017-164056  FUR-TA-10001307
506  US-2017-165456  FUR-CH-10003981

[507 rows x 2 columns]


count of all the rows(Order ID + Product ID) that are present in data1 but not present in data2
Order ID      507
Product ID    507
dtype: int64

##### 2). How to identify the Records (Order ID + Product ID combination) missing in data1 but present in data2 (Specify the number of records missing in your answer)

In [34]:
# this is just reverse of the above query 
# here we can join the table (data2 to data1) and see all the result that are present in data2 table but not in 
# first table which is data1 


query_result2 = pysqldf('select data2.`Order ID`,data2.`Product ID` from data2 left join data1 on\
    data1.`Order ID` = data2.`Order ID` and data1.`Product ID` = data2.`Product ID` where data1.`Order ID` is null \
    and data1.`Product ID` is null')

query_result2

           Order ID       Product ID
0    CA-2014-100706  TEC-AC-10001314
1    CA-2014-100762  OFF-PA-10001815
2    CA-2014-101427  OFF-AR-10002257
3    CA-2014-102652  FUR-FU-10001918
4    CA-2014-102869  OFF-PA-10000788
..              ...              ...
503  US-2017-165344  OFF-BI-10003196
504  US-2017-165358  TEC-CO-10001943
505  US-2017-167920  OFF-AP-10000159
506  US-2017-169502  OFF-AP-10001947
507  US-2017-169551  FUR-BO-10001519

[508 rows x 2 columns]

In [35]:
print('count of all the rows(Order ID + Product ID) that are present in data2 but not present in data1')
query_result2.count()

count of all the rows(Order ID + Product ID) that are present in data2 but not present in data1

Order ID      508
Product ID    508
dtype: int64

#### 3. Find the Sum of the total Qty of Records missing in data1 but present in data2

In [42]:
# this is same as 2nd question here we need to take all the quantity insted of counting the number of records 


query = "select sum(data2.Qty) as sum_of_quantity from data2 left join data1 on\
    data1.`Order ID` = data2.`Order ID` and data1.`Product ID` = data2.`Product ID` where data1.`Order ID` is null \
    and data1.`Product ID` is null"



# sum of all quantity that are present in data2 but missing in data1 table 
query_result3 = pysqldf(query)
query_result3

   sum_of_quantity
0             1956

#### 4. Find the total number of unique records (Order ID + Product ID combination) present in the combined dataset of data1 and data2

In [53]:

 # take union of both datasets
 # then count the unique rows of the combined dataset 


df = pysqldf('select * from data1 union select * from data2;')

                   # select count(distinct `Order ID`) form df group by `Order ID`, `Product ID`
query_result4 = pysqldf('select distinct `Order ID`,`Product ID` from df group by `Order ID`,`Product ID`')
                  
     


# here result will be same without grouping because (Order ID + Product ID) is primary key of the table so the 
# result will be same as above 

               
query_result = pysqldf('select distinct `Order ID`, `Product ID` from df')
print(query_result.count())

# same as above 
print(query_result4.count())

Order ID      9986
Product ID    9986
dtype: int64
Order ID      9986
Product ID    9986
dtype: int64